yt11dev.СК/src/DataProcessors/СК_МобСклад/СК_МобСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СК_МобСклад</name>
</mdclass:DataProcessor>

yt11dev.СК/src/AccumulationRegisters/СК_ТоварыНаСкладах/СК_ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СК_ТоварыНаСкладах</name>
  <resources>
    <name>Вналичии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СК_Ячейки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

yt11dev.СК/src/Enums/ВидыДвиженияНакопления/ВидыДвиженияНакопления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="620f4fb1-f265-408c-a5dc-7f66421e133b">
  <name>ВидыДвиженияНакопления</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f0e7f236-529a-4492-b4b5-c6b0366e5eac">
    <name>Приход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="654dd705-8d30-4aca-8566-2942ac5e614b">
    <name>Расход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

yt11dev.СК/src/DataProcessors/СК_МобСклад/Forms/ОчиститьЯчейку/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.ШК.РедактированиеТекста = Истина;
	АктивироватьПоиск();

КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПоиск() 
	ОчиститьШКСервер(); 
	Элементы.ШК.ОбновитьТекстРедактирования();
	Элементы.ШК.Видимость = Ложь;
	Элементы.ШК.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШК; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	ШК = "";
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШК;
КонецПроцедуры

&НаСервере
Процедура ШКИзменениеТекстаРедактированияНаСервере(ШК)
	Ячейка = Справочники.СК_Ячейки.НайтиПоРеквизиту("ШтрихКод",СокрЛП(ШК));
	Если Ячейка.Пустая() Тогда 
		Элементы.Ошибка.Заголовок = "Ячейка не найдена";
	Иначе 
		Элементы.Ошибка.Заголовок = Ячейка;
		ЭтаФорма.Элементы.Очистить.Видимость = Истина;
	КонецЕсли;
	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ШКИзменениеТекстаРедактированияНаСервере(Текст);
КонецПроцедуры

&НаСервере
Функция ОчиститьНаСервере()
	Ош = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
|	СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
|	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК Количество,
|	СК_ТоварыНаСкладахОстатки.Ячейка КАК Ячейка,
|	&Время КАК Время,
|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияНакопления.Расход) КАК ВидДвижения

|ИЗ
|	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
|ГДЕ
|	СК_ТоварыНаСкладахОстатки.Ячейка = &Ячейка";
	
	Запрос.УстановитьПараметр("Ячейка",Ячейка);
	Запрос.УстановитьПараметр("Время",ТекущаяДата());
	
	Рез = Запрос.Выполнить().Выгрузить();  
	Если Рез.Количество()>=1 Тогда
		Док = Документы.СК_Корректировка.СоздатьДокумент();
		Док.Дата = ТекущаяДата();
		Док.Товары.Загрузить(Рез);
		
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Док.Записать(РежимЗаписиДокумента.Запись);
			Ош = Ложь;
		КонецПопытки;
	Иначе
		Ош = Ложь;
	КонецЕсли;
	
	Возврат Ош;
КонецФункции

&НаКлиенте
Процедура Очистить(Команда)
		Если ОчиститьНаСервере() Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);
			ПоказатьПредупреждение(Оповещение,"Ячейка очищена",5,"");
			
		Иначе
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);
			ПоказатьПредупреждение(Оповещение,"Произошла ошибка или буфер пустой",5,"");
		КонецЕсли;
	КонецПроцедуры  
	
	&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт
	ЭтаФорма.Закрыть();
КонецПроцедуры
